docs/src/diagrams/src/dependency-graph.puml
@startdot
digraph G {
	graph [bb="0,0,1028.7,180"];
	node [label="\N"];
	benchmark	[height=0.5,
		pos="966.35,90",
		width=1.7332];
	"cpp-sequential"	[height=0.5,
		pos="657.35,18",
		width=2.1845];
	frontend	[height=0.5,
		pos="149.35,162",
		width=1.4082];
	"js-gpu"	[height=0.5,
		pos="55.35,90",
		width=1.0832];
	frontend -> "js-gpu"	[pos="e,75.188,105.77 128.49,145.46 115.2,135.57 97.812,122.62 83.328,111.83",
		style=dashed];
	"js-sequential"	[height=0.5,
		pos="356.35,90",
		width=1.9318];
	frontend -> "js-sequential"	[pos="e,315.92,104.67 184.93,148.97 218.36,137.66 268.7,120.64 306.2,107.96",
		style=dashed];
	"js-workers"	[height=0.5,
		pos="171.35,90",
		width=1.6429];
	frontend -> "js-workers"	[pos="e,165.92,108.28 154.68,144.05 157.12,136.26 160.09,126.82 162.84,118.08",
		style=dashed];
	meta	[height=0.5,
		pos="307.35,18",
		width=0.95686];
	frontend -> meta	[pos="e,273.04,19.76 100.55,156.74 68.278,151.09 28.207,138.05 7.3498,108 -1.7739,94.856 -2.9328,84.258 7.3498,72 39.448,33.734 187.47,\
23.083 262.9,20.128",
		style=dashed];
	"wasm-sequential"	[height=0.5,
		pos="533.35,90",
		width=2.4734];
	frontend -> "wasm-sequential"	[pos="e,468.53,102.37 186.62,149.7 194.11,147.64 201.95,145.63 209.35,144 308.67,122.1 335.02,124.69 435.35,108 442.9,106.74 450.76,105.41 \
458.62,104.07",
		style=dashed];
	"js-gpu" -> meta	[pos="e,276.36,26.171 84.919,78.078 90.984,75.965 97.348,73.839 103.35,72 159.31,54.856 224.98,38.446 266.38,28.545",
		style=dashed];
	"js-sequential" -> meta	[pos="e,318.76,35.307 344.49,72.055 338.5,63.505 331.13,52.975 324.54,43.556",
		style=dashed];
	"js-workers" -> meta	[pos="e,283.53,31.258 200.19,74.155 221.98,62.938 251.92,47.532 274.61,35.853",
		style=dashed];
	"wasm-sequential" -> "cpp-sequential"	[pos="e,629.03,34.985 561.8,72.941 579.13,63.159 601.46,50.552 620.17,39.986",
		style=dashed];
	"wasm-sequential" -> meta	[pos="e,336.29,27.965 486.8,74.581 445.28,61.722 385.21,43.115 346.21,31.037",
		style=dashed];
	"js-benchmarks"	[height=0.5,
		pos="533.35,162",
		width=2.1665];
	"js-benchmarks" -> benchmark	[pos="e,921.03,102.49 601.04,152.93 673.99,143.81 793.37,127.63 895.35,108 900.43,107.02 905.7,105.92 910.96,104.77",
		style=dashed];
	"js-benchmarks" -> "js-gpu"	[pos="e,83.981,102.28 463.03,154.21 359.2,143.87 169.97,123.71 103.35,108 100.17,107.25 96.9,106.36 93.642,105.39",
		style=dashed];
	"js-benchmarks" -> "js-sequential"	[pos="e,392.92,105.46 495.81,146.15 468.55,135.37 431.51,120.72 402.45,109.23",
		style=dashed];
	"js-benchmarks" -> "js-workers"	[pos="e,219.92,100.39 475.59,149.83 408.28,136.82 297.67,115.43 229.99,102.34",
		style=dashed];
	"js-benchmarks" -> meta	[pos="e,341.78,19.264 580.19,147.55 599.57,139.41 620.11,126.86 631.35,108 639.54,94.256 641.71,84.193 631.35,72 596.03,30.431 432.4,21.394 \
352.08,19.481",
		style=dashed];
	"js-benchmarks" -> "wasm-sequential"	[pos="e,533.35,108.1 533.35,143.7 533.35,135.98 533.35,126.71 533.35,118.11",
		style=dashed];
	"node-cpp-sequential"	[height=0.5,
		pos="782.35,90",
		width=2.8886];
	"js-benchmarks" -> "node-cpp-sequential"	[pos="e,730.38,105.61 580.77,147.67 620.44,136.52 677.31,120.53 720.54,108.38",
		style=dashed];
	"node-cpp-sequential" -> "cpp-sequential"	[pos="e,685.61,34.827 753.04,72.588 735.56,62.795 713.18,50.267 694.47,39.787",
		style=dashed];
	"node-cpp-sequential" -> meta	[pos="e,340.05,23.819 706.03,77.753 605.14,62.885 430.76,37.187 350.31,25.33",
		style=dashed];
	"test-simple"	[height=0.5,
		pos="280.35,162",
		width=1.7332];
	"test-simple" -> "js-gpu"	[pos="e,84.973,101.75 237.61,148.84 201.64,138.46 148.94,122.89 103.35,108 100.46,107.06 97.48,106.06 94.487,105.04",
		style=dashed];
	"test-simple" -> "js-sequential"	[pos="e,338.47,107.47 298.36,144.41 308.11,135.43 320.31,124.19 331.01,114.34",
		style=dashed];
	"test-simple" -> "js-workers"	[pos="e,195.73,106.66 255.89,145.29 240.74,135.56 221.09,122.95 204.55,112.32",
		style=dashed];
	"test-simple" -> meta	[pos="e,295.25,35.219 276.91,143.95 273.9,125.79 270.93,96.369 277.35,72 279.92,62.239 284.75,52.387 289.79,43.87",
		style=dashed];
	"test-simple" -> "wasm-sequential"	[pos="e,483.04,104.92 323.84,148.97 365.04,137.57 427.27,120.35 473.21,107.64",
		style=dashed];
}

@enddot
